// 1. ДНК
// Дезоксирибонуклеїнова кислота (ДНК) — це хімічна речовина, що міститься в ядрі клітин і несе «інструкції» для розвитку
// та функціонування живих організмів. Якщо ви хочете дізнатися більше, http://en.wikipedia.org/wiki/DNA
// У рядках ДНК символи «А» і «Т» доповнюють один одного, як «С» і «G». У вас є функція з однією стороною ДНК - вам
// потрібно отримати іншу комплементарну сторону. Нитку ДНК ніколи не буває порожнім або ДНК взагалі немає.
//
//     Приклад:
// DNA_strand("ATTGC") # повертає "TAACG"
// DNA_strand("GTAT") # повертає "CATA"
function DNA(str) {
    let result = "";
    for (let i = 0; i < str.length; i++) {
        switch (str[i]) {
            case "A":
                result += "T";
                break;
            case "T":
                result += "A";
                break;
            case "C":
                result += "G";
                break;
            case "G":
                result += "C";
                break;

        }
    }
    return result;
}
