// 1. Однакові цифри в діапазоні
// Створіть веб-програму, в якій користувач вводить два числа (межі діапазону) від 10 до 99. Потрібно знайти і вивести
// в консоль через кому всі числа в діапазоні, які мають хоч дві однакові цифри.
let num1, num2;
do {
    num1 = Number(prompt('Введите первое число диапазона'));
    if (num1 < 10 || num1 > 99 || Number.isNaN(num1)) {
        alert('Попробуйте еще раз ввести!');
    }
} while (num1 < 10 || num1 > 99);
do {
    num2 = Number(prompt('Введите второе число диапазона'));
    if (num2 < 10 || num2 > 99 || num2 < num1 || Number.isNaN(num2)) {
        alert('Попробуйте еще раз ввести!');
    }
} while (num2 < 10 || num2 > 99 || num2 < num1);

let str = '';
for (let i = num1; i <= num2; i++) {
    if (i % 11 == 0) {
        if ((num2 - i) >= 11){
            str += i + ', ';
        } else {
            str += i;
        }
    }
}
console.log(str);